In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.rand(5,5), columns=["A","B","C","D","E"], index=["Berkat", "Jane", "Bark", "Leo", "Femi"])

In [3]:
df

               A         B         C         D         E
Berkat  0.774511  0.065023  0.871514  0.732991  0.810670
Jane    0.798198  0.261252  0.859020  0.665152  0.234439
Bark    0.898466  0.341356  0.409793  0.934376  0.309313
Leo     0.237740  0.767393  0.786109  0.069684  0.451842
Femi    0.539961  0.491626  0.707200  0.761109  0.318842

### Filter

In [4]:
df.loc[["Berkat","Bark"], ["C", "E"]]

               C         E
Berkat  0.871514  0.810670
Bark    0.409793  0.309313

In [5]:
df[["C","B"]]

               C         B
Berkat  0.871514  0.065023
Jane    0.859020  0.261252
Bark    0.409793  0.341356
Leo     0.786109  0.767393
Femi    0.707200  0.491626

In [6]:
df[df["C"] > .6]

               A         B         C         D         E
Berkat  0.774511  0.065023  0.871514  0.732991  0.810670
Jane    0.798198  0.261252  0.859020  0.665152  0.234439
Leo     0.237740  0.767393  0.786109  0.069684  0.451842
Femi    0.539961  0.491626  0.707200  0.761109  0.318842

In [7]:
df.index

Index(['Berkat', 'Jane', 'Bark', 'Leo', 'Femi'], dtype='object')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [9]:
df["A"].idxmax()

'Bark'

In [10]:
df.loc["Bark"].max()

0.9343762427740838

In [21]:
dd = {"Company": ["Google", "Google", "Amazon", "Amazon", "Tesla"], "Users": ["Berkat","Femi","George","Matt","Steve"], "Compensation": [120000,110000,320000,60000,75000], "Scores": [200,130,560,600,136]}

In [22]:
frame = pd.DataFrame(dd)

In [23]:
frame

  Company   Users  Compensation  Scores
0  Google  Berkat        120000     200
1  Google    Femi        110000     130
2  Amazon  George        320000     560
3  Amazon    Matt         60000     600
4   Tesla   Steve         75000     136

In [29]:
frame.groupby("Company").sum()

         Compensation  Scores
Company
Amazon         380000    1160
Google         230000     330
Tesla           75000     136